/*------------------------------------------------
【程序设计】
--------------------------------------------------

身高预测
每个做父母的都关心自己孩子成人后的身高，据有关生理卫生知识与数理统计分析表明，
影响小孩成人后身高的因素包括遗传、饮食习惯与体育锻炼等。
小孩成人后的身高与其父母的身高和自身的性别密切相关。
设faHeight为其父身高，moHeight为其母身高，身高预测公式为：
男性成人时身高=（faHeight+moHeight）×0.54cm
女性成人时身高=（faHeight×0.923+moHeight）/2cm
此外，若喜爱体育锻炼，则可增加身高2%；若有良好的卫生饮食习惯，则可增加身高1.5%。
请编程从键盘输入用户的性别（用字符型变量sex存储，输入F表示女性，输入M表示男性）、
父母身高（用实型变量存储，faHeight为其父身高，moHeight为其母身高）、
是否喜爱体育锻炼（用字符型变量sports存储，输入Y表示喜爱，输入N表示比喜爱）、
是否有良好的饮食习惯（用字符型变量diet存储，输入Y表示良好，输入N表示不好）等条件，
利用给定公式和身高预测方法对身高进行预测。

------------------------------------------------*/
#include <stdio.h>
void main()
{
        char sex;//性别
        char sports;//是否喜爱体育锻炼
        char diet;//是否有良好的饮食习惯
        float faHeight,maHeight,Height;
        /**********Program**********/
        //这题没法写，要求不明确
         /**********  End  **********/
}
