/*------------------------------------------------
【程序设计】
--------------------------------------------------
利用公式计算π的值：
π/4=1-1/3+1/5-1/7+....
编程计算π的近似值，直到最后一项的绝对值小于10-6为止，
输出π的值并统计累加的项数。
要求：用do...while循环
------------------------------------------------*/

#include <stdio.h>
#include <math.h>
void main()
{
        int fm=1,fz=1,n=0; /*fm:分母，fz：分子，n:项数*/
        float term,pi=0;   /*term：第i项的值 */
        /**********Program**********/
        do{
			n++;
            fm=2*n-1;
            term=1.0*fz/fm;
			if(n%2==0)
			pi-=term;
			else
				pi+=term;
        }while(fabs(term)>1e-6);
        pi*=4;
         /**********  End  **********/
        printf("pi=%f\ncount=%d\n",pi,n);

}
